<?php
// +----------------------------------------------------------------------
// | Name 风音框架
// +----------------------------------------------------------------------
// | Author 唐启云 <tqy@fxri.net>
// +----------------------------------------------------------------------
// | Copyright Copyright © 2016-2099 方弦研究所. All rights reserved.
// +----------------------------------------------------------------------
// | Link https://www.fxri.net
// +----------------------------------------------------------------------

// 语言列表包
return [
    //============================================================
    // 名词-n.-noun
    'chinese' => '中文',
    'english' => '英语',
    // 名词词组
    'chinese(simplified)' => '中文（简体）',
    'chinese(traditional)' => '中文（繁体）',
    'english(usa)' => '英语（美国）',
    'english(england)' => '英语（英国）',
    // 名词数组
    'lang_list' => [
        'zh-cn' => '中文（简体）',
        'en-us' => '英语（美国）',
    ],
    //============================================================
    // 页面状态
    'http 100' => '100 继续',
    'http 101' => '101 切换协议',
    'http 102' => '102 继续处理',
    'http 200' => '200 请求成功',
    'http 201' => '201 已创建',
    'http 202' => '202 已接受',
    'http 203' => '203 非授权信息',
    'http 204' => '204 无内容',
    'http 205' => '205 重置内容',
    'http 206' => '206 部分内容',
    'http 207' => '207 多个状态',
    'http 300' => '300 多种选择',
    'http 301' => '301 永久移动',
    'http 302' => '302 临时移动',
    'http 303' => '303 查看其他地址',
    'http 304' => '304 未修改',
    'http 305' => '305 使用代理',
    'http 306' => '306 切换代理',
    'http 307' => '307 临时重定向',
    'http 400' => '400 请求语法错误',
    'http 401' => '401 需要身份认证',
    'http 402' => '402 需要付费',
    'http 403' => '403 禁止访问',
    'http 404' => '404 无法找到',
    'http 405' => '405 方法不被允许',
    'http 406' => '406 无法接受',
    'http 407' => '407 代理需要身份认证',
    'http 408' => '408 请求超时',
    'http 409' => '409 指令冲突',
    'http 410' => '410 资源已经不存在',
    'http 411' => '411 需要内容长度',
    'http 412' => '412 先决条件错误',
    'http 413' => '413 请求实体过大',
    'http 414' => '414 请求URI过长',
    'http 415' => '415 无效媒体格式',
    'http 416' => '416 请求范围无效',
    'http 417' => '417 请求头错误',
    'http 418' => '418 我就是个杯具',
    'http 421' => '421 错误的请求',
    'http 422' => '422 不可处理实体',
    'http 423' => '423 锁定',
    'http 424' => '424 失败的依赖项',
    'http 425' => '425 重放攻击',
    'http 426' => '426 需要升级',
    'http 449' => '449 操作后进行重试',
    'http 451' => '451 因法律原因无法获得',
    'http 500' => '500 服务器内部错误',
    'http 501' => '501 请求功能不支持',
    'http 502' => '502 网关错误',
    'http 503' => '503 服务不可用',
    'http 504' => '504 网关超时',
    'http 505' => '505 HTTP协议版本不支持',
    'http 506' => '506 内部配置错误',
    'http 507' => '507 存储不足',
    'http 509' => '509 超出带宽限制',
    'http 510' => '510 未扩展',
    'http 600' => '600 不可解析的响应头',
];
