<?php
// +----------------------------------------------------------------------
// | Name fxyin
// +----------------------------------------------------------------------
// | Author wztqy <wztqy@139.com>
// +----------------------------------------------------------------------
// | Copyright Copyright © 2016-2099 fxri. All rights reserved.
// +----------------------------------------------------------------------
// | Link http://www.fxri.net
// +----------------------------------------------------------------------

/**
 * 框架配置
 * @return array
 */
return [
    //框架调试模式
    'fxy_debug' => false,
    //框架日志模式
    'fxy_log' => false,
    //框架日志等级
    'fxy_log_level' => '1,2,3,4,5,6',
    //语言变量
    'lang' => [
        //前缀-忽略转换
        'prefix' => '!@',
        //前缀-忽略文本
        'ignore' => '!#',
        //缓存有效期 0表示永久缓存
        'expire' => 0,
        //开关-多语言
        'switch' => true,
    ],
    //文件-媒体
    'file_media' => [
        //视频
        'video' => [
            //启动
            'bin' => null,
            //目录
            'path' => [
                //Linux系统
                'linux' => null,
                //Windows系统
                'windows nt' => null,
            ],
        ],
    ],
];
