<?php
// +----------------------------------------------------------------------
// | Name 风音框架
// +----------------------------------------------------------------------
// | Author 唐启云 <tqy@fxri.net>
// +----------------------------------------------------------------------
// | Copyright Copyright © 2016-2099 方弦研究所. All rights reserved.
// +----------------------------------------------------------------------
// | Link https://www.fxri.net
// +----------------------------------------------------------------------

namespace fxapp;

/**
 * 数学类
 * @see \fxapp\facade\Math
 * @package fxapp\facade
 * @method static string rand(int $length, int $type = 0) 随机字符
 */
class Math extends \fxyin\Facade
{
}
